package s28;

import java.util.Iterator;

/*
 * School კლასი(2018 წლის გამოცდის ამოცანა).
 * 
 * თქვენი მიზანია დაწეროთ School კლასი, რომლის საშუალებითაც შევძლებთ უნივერსიტეტის მართვას. 
 * კლასს უნდა ჰქონდეს კონსტრუქტორი და 5 public მეთოდი.
 */
public class School {

	/*
	 * კონსტრუქტორს არაფერი არ გადაეცემა. აქ შეგიძლიათ ინიციალიზაცია გაუკეთოთ
	 * თქვენთვის საჭირო ცვლადებს.
	 */
	public School() {
		// ToDo: Implement
	}

	/*
	 * addTeacher მეთოდის საშუალებით შეგიძლიათ სკოლას დაამატოთ ახალი მასწავლებელი.
	 * მეთოდს გადაეცემა მასწავლებლის სახელი. შეგიძლიათ ჩათვალოთ, რომ მასწავლებლის
	 * სახელი უნიკალურია.
	 */
	public void addTeacher(String teacher) {
		// ToDo: Implement
	}

	/*
	 * addSubject მეთოდის საშუალებით შეგიძლიათ მასწავლებელს დაუმატოთ საგანი. მეთოდს
	 * გადაეცემა მასწავლებლის სახელი და საგნის სახელი. ჩათვალეთ, რომ საგნის სახელი
	 * უნიკალურია. ერთი და იგივე მასწავლებელი შეიძლება რამდენიმე საგანს კითხულობდეს,
	 * ასევე ერთსა და იმავე საგანს შეიძლება რამდენიმე მასწავლებელი კითხულობდეს
	 * ერთდროულად. თუკი teacher სახელის მქონე მასწავლებელი არ არის აქამდე
	 * დამატებული, მაშინ მეთოდმა არაფერი არ უნდა გააკეთოს.
	 */
	public void addSubject(String teacher, String subject) {
		// ToDo: Implement
	}

	/*
	 * addPupil მეთოდის საშუალებით შეგიძლიათ საგანზე დაამატოთ მოსწავლე. ერთი და
	 * იგივე მოსწავლე შეიძლება ერთ ან რამდენიმე საგანს სწავლობდეს.
	 */
	public void addPupil(String pupil, String subject) {
		// ToDo: Implement
	}

	/*
	 * getTeachers მეთოდს გადაეცემა მოსწავლის სახელი და მან უნდა დააბრუნოს ამ
	 * მოსწავლის ყველა მასწავლებელზე იტერატორი. ანუ მხოლოდ იმ მასწავლებლების
	 * სახელები, რომლებიც ასწავლიან იმ საგნებს, რომლებზეც მოსწავლეა
	 * დამატებული(სწავლობს). თუკი pupil სახელის მოსწავლე არ გვყავს მაშინ მეთოდმა
	 * უნდა დააბრუნოს null.
	 */
	public Iterator<String> getTeachers(String pupil) {
		// ToDo: Implement
		return null;
	}

	/*
	 * getPupils მეთოდს გადაეცემა მასწავლებლის სახელი და მან უნდა დააბრუნოს ამ
	 * მასწავლებლის ყველა სტუდენტზე იტერატორი. ანუ მხოლოდ იმ სტუდენტების სახელები,
	 * რომლებიც მის რომელიმე საგანს სწავლობენ. თუკი teacher სახელის მქონე ლექტორი არ
	 * გვყავს მაშინ მეთოდმა უნდა დააბრუნოს null.
	 */
	public Iterator<String> getPupils(String teacher) {
		// ToDo: Implement
		return null;
	}

	/*
	 * მეთოდმა უნდა წაშალოს მასწავლებლის შესახებ ყველა ინფორმაცია. ამ მეთოდის
	 * გამოძახების, შემდეგ getTeachers მეთოდმა არ უნდა დააბრუნოს teacher სახელი არც
	 * ერთი სტუდენტისთვის.
	 */
	public void removeTeacher(String teacher) {
		// ToDo: Implement
	}
}
