package s28;

import java.util.Iterator;

public interface School {
	/*
	 * addTeacher მეთოდის საშუალებით შეგიძლიათ სკოლას დაამატოთ ახალი მასწავლებელი.
	 * მეთოდს გადაეცემა მასწავლებლის სახელი. შეგიძლიათ ჩათვალოთ, რომ მასწავლებლის
	 * სახელი უნიკალურია.
	 */
	public void addTeacher(String teacher);

	/*
	 * addSubject მეთოდის საშუალებით შეგიძლიათ მასწავლებელს დაუმატოთ საგანი. მეთოდს
	 * გადაეცემა მასწავლებლის სახელი და საგნის სახელი. ჩათვალეთ, რომ საგნის სახელი
	 * უნიკალურია. ერთი და იგივე მასწავლებელი შეიძლება რამდენიმე საგანს კითხულობდეს,
	 * ასევე ერთსა და იმავე საგანს შეიძლება რამდენიმე მასწავლებელი კითხულობდეს
	 * ერთდროულად. თუკი teacher სახელის მქონე მასწავლებელი არ არის აქამდე
	 * დამატებული, მაშინ მეთოდმა არაფერი არ უნდა გააკეთოს.
	 */
	public void addSubject(String teacher, String subject);

	/*
	 * addPupil მეთოდის საშუალებით შეგიძლიათ საგანზე დაამატოთ მოსწავლე. ერთი და
	 * იგივე მოსწავლე შეიძლება ერთ ან რამდენიმე საგანს სწავლობდეს.
	 */
	public void addPupil(String pupil, String subject);

	/*
	 * getTeachers მეთოდს გადაეცემა მოსწავლის სახელი და მან უნდა დააბრუნოს ამ
	 * მოსწავლის ყველა მასწავლებელზე იტერატორი. ანუ მხოლოდ იმ მასწავლებლების
	 * სახელები, რომლებიც ასწავლიან იმ საგნებს, რომლებზეც მოსწავლეა
	 * დამატებული(სწავლობს). თუკი pupil სახელის მოსწავლე არ გვყავს მაშინ მეთოდმა
	 * უნდა დააბრუნოს null.
	 */
	public Iterator<String> getTeachers(String pupil);

	/*
	 * getPupils მეთოდს გადაეცემა მასწავლებლის სახელი და მან უნდა დააბრუნოს ამ
	 * მასწავლებლის ყველა სტუდენტზე იტერატორი. ანუ მხოლოდ იმ სტუდენტების სახელები,
	 * რომლებიც მის რომელიმე საგანს სწავლობენ. თუკი teacher სახელის მქონე ლექტორი არ
	 * გვყავს მაშინ მეთოდმა უნდა დააბრუნოს null.
	 */
	public Iterator<String> getPupils(String teacher);

	/*
	 * მეთოდმა უნდა წაშალოს მასწავლებლის შესახებ ყველა ინფორმაცია. ამ მეთოდის
	 * გამოძახების, შემდეგ getTeachers მეთოდმა არ უნდა დააბრუნოს teacher სახელი არც
	 * ერთი სტუდენტისთვის.
	 */
	public void removeTeacher(String teacher);
}
